gneidermeier/stm8_mcp/src/main.c
    strcat(sbuf, " 003=");
    itoa( Back_EMF_Falling_4[3],     cbuf, 16);
    strcat(sbuf, cbuf);	
#endif

#if 1
    strcat(sbuf, " UI=");
    itoa(UI_Speed, cbuf, 16);
    strcat(sbuf, cbuf);
#endif

    strcat(sbuf, "\r\n");
    UARTputs(sbuf);
}



void BLDC_PWMDC_Set(uint16_t dc);
/*
 * Execution context is 'main()' so not to block ISR with ADC sampling.
 * TODO moving A/D acquisition to ramp-step (TIM3) to coordinate with PWM on/off cycling.
 * Servicing the UART (presently just a simply one-way logging stream)
 */
void Periodic_task(void)
{
    static int Fault = 0;
    static int manual_mode_start = 0;

    char sbuf[16] = "";
    char cbuf[8] = { 0, 0 };
    char key;


//   svc a UI potentiometer
    UI_Speed = ADC1_GetBufferValue( ADC1_CHANNEL_3 ); // ADC1_GetConversionValue();
    UI_Speed /= 16; // use [ 0: 63 ]
#if 0
    if (0 == manual_mode_start )
    {
// was NOT started in dev/test mode, so go ahead and use "UI" (servo-pulse?) input

        if (0 == Fault){
            BLDC_PWMDC_Set(UI_Speed); // note only does anything if BLDC_ON 
        } else {
            BLDC_PWMDC_Set(0);
        }
    }
#endif
    /*
     * debug logging information can be "scheduled" by setting the level, which for now
     * simply designates number of reps ... spacing TBD? this task is now tied to
     * BLDC Update cycle ( about 1/2sec?)
     */
    if (Log_Level > 0)
    {
// allow log to sticky-on
        if (Log_Level < 255)
        {
            Log_Level -= 1;
        }

        testUART();// tmp test
    }

    if (SerialKeyPressed((char*)&key))
    {
        if (key == '+')
        {
            disableInterrupts();
            manual_mode_start = 1; // flag this op as a manual mode cycle
            BLDC_PWMDC_Plus();
            enableInterrupts();
            UARTputs("+++\r\n");

           Log_Level = 255;// enable continous/verbous log

        }
        else if (key == '-')
        {
            disableInterrupts();
            manual_mode_start = 1; // flag this op as a manual mode cycle
            BLDC_PWMDC_Minus();
            enableInterrupts();
            UARTputs("---\r\n");
        }
//BLDC_Stop
        else if (key == ' ')
        {
           Fault = 1; // hack
            disableInterrupts();
            manual_mode_start = 0; // clear manual mode cycle flag
            BLDC_Stop();
            enableInterrupts();
            UARTputs("###\r\n");
        }
        else if (key >= '0' && key <= '9' )
        {
            uint16_t nn = (unsigned int)key;
            nn = (nn * 250) / 10; 
            BLDC_PWMDC_Set(nn);
        }
        else // anykey
        {
            Log_Level = 5; // show some info
            Fault = 0;
        }

        itoa(UI_Speed, cbuf, 16);
        strcat(sbuf, cbuf);
        strcat(sbuf, "\r\n");
        UARTputs(sbuf);
    }
}

/*
 * mainly looping
 */
main()
{
    clock_setup();
    GPIO_Config();
    UART_setup();
    ADC1_setup();
    TIM1_setup();
    TIM2_setup();
    TIM4_setup();

    BLDC_Stop();
    Log_Level = 0;

    enableInterrupts(); // interrupts are globally disabled by default

    uart_print("\033c"); // sends ANSI code to  clear the serial terminal
    uart_print("Program Startup....... \r\n");

    while(1)
    {
        uint16_t debounce_ct;
        uint16_t ainp;
//  button input either button would transition from OFF->RAMP
        if (! (( GPIOA->IDR)&(1<<4)))
        {
//            while( ! (( GPIOA->IDR)&(1<<4)) ); // no concern for debounce for a stop switch
            disableInterrupts();
            BLDC_Stop();
            enableInterrupts();
            // reset line couunter of the serial-port logger
            Line_Count = -1;
//          testUART(); // call one time to get final data
        }

        if (! (( GPIOA->IDR)&(1<<6)))
        {
            while( ! (( GPIOA->IDR)&(1<<6)) ); // wait for debounce (sorta works)
//  TEST DEV ONLY: manual adjustment of commutation cycle time
            disableInterrupts();
            BLDC_Spd_inc();
            enableInterrupts();
        }

        if ( ! (( GPIOE->IDR)&(1<<5)))
        {
            while( ! (( GPIOE->IDR)&(1<<5)) ) {;} // wait for debounce (sorta works)
//  TEST DEV ONLY: manual adjustment of commutation cycle time
            disableInterrupts();
            BLDC_Spd_dec();
            enableInterrupts();
        }

// while( FALSE == TaskRdy )
        if ( FALSE == TaskRdy )  // idk .. don't block here in case there were actually some background tasks to do
        {
            nop();
        }
        else
        {
            // theoretically no time-limit for the periodic task? ... periodic task should be interruptible
            TaskRdy = FALSE;
            Periodic_task();
        }
    } // while 1
}

#ifdef USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *   where the assert_param error has occurred.
  * @param file: pointer to the source file name
  * @param line: assert_param error line source number
  * @retval : None
  */
void assert_failed(u8* file, u32 line)
{
    /* User can add his own implementation to report the file name and line number,
       ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

    /* Infinite loop */
    while (1)
    {
    }
}
#endif

/******************* (C) COPYRIGHT 2009 STMicroelectronics *****END OF FILE****/
